# Solutions for Topic 3 Exercise Sheet

_Note: Cell Language is set to MSSQL and does connect to any data source. SQL generated on 2425-AppDB machine with employees database.</br>
Comment are in MS SQL Format "--"_

1. Get employees.sql from Moodle and import it into MySQL.

Applied SQL Script to generate MySQL 'employee' database within 2425-appDB machine: [employee.sql](https://github.com/ngn73/8637_applied_databases/blob/main/resources/sql/employees.sql)

2. Print out the emp_no, first_name and a capitalised version of the employees last_name,
using the same column names that are in the table for the first 10 employees returned from
the database

In [ ]:
SELECT emp_no, first_name, UPPER(last_name) FROM employees LIMIT 10;

3. Sort the employees table based on:</br>
- The length of last_name</br>
- Alphabetical order of last_name</br>
- The length of first_name</br>
- Alphabetical order of first_name</br>

In [ ]:
USE employees;

SELECT * FROM employees
ORDER BY LENGTH(last_name);

SELECT * FROM employees
ORDER BY last_name ASC;

SELECT * FROM employees
ORDER BY LENGTH(first_name);

SELECT * FROM employees
ORDER BY first_name ASC;

4. Show all details of the first 10 employees returned from the database and an extra column
called Initials that shows the employeeâ€™s initials.

In [ ]:
SELECT *, CONCAT(SUBSTRING(first_name, 1, 1), SUBSTRING(last_name, 1, 1)) AS initials FROM employees LIMIT 10;

5. Show all details of all Females born in the 1950s and hired between September 1st 1988 and
February 28th 1991.

In [ ]:
SELECT * FROM employees 
WHERE 
gender = 'F'
AND
YEAR(birth_date) BETWEEN 1950 AND 1959
AND
hire_date BETWEEN '1988-09-01' AND '1991-02-28';

6. Show the average salary from the salaries table formatted to two decimal places.
E.g. 12345.6789 should become 12,345.68.

In [ ]:
SELECT FORMAT(AVG(salary), 2) AS 'avg_salary' FROM salaries;

7. Show the emp_no and average salary for each employee formatted to two decimal places.

In [ ]:
--Cannot aggregate AVG() for each employee record ??
SELECT emp_no, FORMAT(salary, 2) AS 'avg_salary' FROM salaries;